Task 1-Create the following table structure in SNOWFLAKE by creating your own warehouse. Insert some 10 rows using INSERT command (check task 3 and same way insert for all task tables) in the table by trying different values for all the columns and then check using SELECT *

In [ ]:

create table shoping_history(
product varchar not null,
quantity int not null,
unit_price int not null);


INSERT INTO shoping_history (product, quantity, unit_price) VALUES ('milk', 3, 10), ('bread', 7, 3), ('bread', 5, 2);
INSERT INTO shoping_history (product, quantity, unit_price) VALUES ('biscuit', 5, 15), ('suger', 5, 8), ('coffee', 5, 4);


select * from shoping_history;

-- Create the shoping_history table
CREATE TABLE shoping_history (
    product VARCHAR NOT NULL,
    quantity INT NOT NULL,
    unit_price INT NOT NULL
);

-- Insert data into the table
INSERT INTO shoping_history (product, quantity, unit_price)
VALUES
    ('milk', 3, 10),
    ('bread', 7, 3),
    ('bread', 5, 2),
    ('biscuit', 5, 15),
    ('suger', 5, 8)
    ('coffee', 5, 4);

  your query should return:
  
  product    total_price 
  milk        30
  bread        31

In [ ]:
SELECT
    product,
    SUM(quantity * unit_price) AS total_price
FROM
    shoping_history
GROUP BY
    product;

Task -2 #A telecommunication company

In [ ]:
Task-1--- Create the phones table
CREATE TABLE phones (
    name VARCHAR(20) NOT NULL UNIQUE,
    phone_number INT NOT NULL UNIQUE
);

-- Insert values into the phones table
INSERT INTO phones (name, phone_number) VALUES
    ('Jack', 1234),
    ('Lena', 3333),
    ('Mark', 9999),
    ('Anna', 7582);

In [ ]:
Task -2 -- Create the calls table
CREATE TABLE calls (
    id INT NOT NULL,
    caller INT NOT NULL,
    callee INT NOT NULL,
    duration INT NOT NULL,
    UNIQUE(id)
);

-- Insert values into the calls table
INSERT INTO calls (id, caller, callee, duration) VALUES
    (25, 1234, 7582, 8),
    (7, 9999, 7582, 1),
    (18, 9999, 3333, 4),
    (2, 7582, 3333, 3),
    (3, 3333, 1234, 1),
    (21, 3333, 1234, 1);

In [ ]:
SELECT p.name
FROM phones p
JOIN calls c ON p.phone_number = c.caller OR p.phone_number = c.callee
GROUP BY p.name
HAVING SUM(c.duration) >= 10
ORDER BY p.name;

In [ ]:
-- Insert values into the phones table
INSERT INTO phones (name, phone_number) VALUES
    ('Jhon', 6356),
    ('Adison', 4315),
    ('kate', 8003),
    ('Ginny', 9831);

-- Insert values into the calls table
INSERT INTO calls (id, caller, callee, duration) VALUES
    (65, 8003, 9831, 7),
    (100, 9831, 8003, 3),
    (145, 4315, 9831, 18);

In [ ]:
-- Insert values into the phones table
INSERT INTO phones (name, phone_number) VALUES
    ('Jhon', 6356),
    ('Adison', 4315),
    ('kate', 8003),
    ('Ginny', 9831);

-- Insert values into the calls table
INSERT INTO calls (id, caller, callee, duration) VALUES
    (65, 8003, 9831, 7),
    (100, 9831, 8003, 3),
    (145, 4315, 9831, 18);

In [ ]:
SELECT p.name
FROM phones p
LEFT JOIN calls c ON p.phone_number = c.caller
                OR p.phone_number = c.callee
GROUP BY p.name
HAVING SUM(c.duration) >= 10
ORDER BY p.name;

Task 3: Output display is just one column balance

In [ ]:
CREATE TABLE transactions(
  AMOUNT INT NOT NULL,
  Date DATE NOT NULL);

INSERT INTO transactions (Amount, Date) VALUES (1000,'2020-01-06');
INSERT INTO transactions (Amount, Date) VALUES (-10,'2020-01-14');
INSERT INTO transactions (Amount, Date) VALUES (-75,'2020-01-20');
INSERT INTO transactions (Amount, Date) VALUES (-5,'2020-01-25');
INSERT INTO transactions (Amount, Date) VALUES (-4,'2020-01-29');
INSERT INTO transactions (Amount, Date) VALUES (2000,'2020-03-10');
INSERT INTO transactions (Amount, Date) VALUES (-75,'2020-03-12');
INSERT INTO transactions (Amount, Date) VALUES (-20,'2020-03-15');
INSERT INTO transactions (Amount, Date) VALUES (40,'2020-03-15');
INSERT INTO transactions (Amount, Date) VALUES (-50,'2020-03-17');
INSERT INTO transactions (Amount, Date) VALUES (200,'2020-10-10');
INSERT INTO transactions (Amount, Date) VALUES (-200,'2020-10-10');

SELECT * FROM transactions;

select sum(amount), count(1), date_part('month', date) as month from transactions where amount < 0 group by month;

SELECT
  Date,
  SUM(Amount) AS total_bal
FROM transactions
GROUP BY date;